mon1 = "<b>Понедельник</b>\n1) 8.30-10.00 Физическая культура и спорт Лекция О.Б. Томашевская MS Teams\n" \
       "2) 10.10-11.40 Математический анализ (лекция) 5.09.2022-19.12.2022 Худенко В.Н. MS Teams\n" \
       "3) 11.50-13.20 Программирование микроконтроллеров (лекция) 5.09.2022-19.12.2022 Леонов С.В. MS Teams"
tue1 = "<b>Вторник</b>\n1) 10:10-11:40 Дифференциальные ур. (лек) 233 ауд.\n" \
       "2) 11:50 – 13:20 Английский ауд 232\n" \
       "3) 13:50 – 15:20  Мат. Анализ (пр) 231 ауд.\n" \
       "4) 15:30 – 17:00 Алгоритмы(л.р) ауд 214\\Английский ауд 232"
wed1 = "<b>Среда</b>\n1) 8:30-10:00 Физика (пр) 209 ауд. (на нижней неделе)\n" \
       "2) 11:50 - 13:20 Программ. Микроконтр. Teams\n" \
       "4) 13:50 – 15:20 Опер. Системы и Комп. Сети Teams."
thu1 = "<b>Четверг</b>\n1) 8:30-10:00 Дифференциальные уравнения(пр) ауд. 233\n" \
       "2) 10:10-11:40 Физика (лек) 231 ауд." \
       "3) 11:50-13:20 Физика (лаб) ауд 226 (на верхней неделе)\\Физика (лаб) ауд 226 (на нижней неделе)\n" \
       "4) 13:50 – 15:20 Алгоритмы(л.р.) ауд. 214"
fri1 = "<b>Пятница</b>\n1) 10:10-11:40 Физра\n" \
       "2) 13:50 – 15:20 Мат. Логика (лек) Teams\n" \
       "3) 15:30 – 17:00 Алгоритмы и структуры данных (лек) Teams.\n" \
       "4) 17:10 – 18:40 Опер. Системы и Комп. Сети (лек)Teams."
sat1 = "<b>Суббота</b>\n1) 10:10 - 11:40 Мат. Логика (пр) 231 ауд."
sun1 = "<b>Воскресенье</b>\nСегодня пар нет"
days_of_week1 = [mon1, tue1, wed1, thu1, fri1, sat1, sun1]

mon2 = "<b>Понедельник</b>\n1) 8.30-10.00 Физическая культура и спорт Лекция О.Б. Томашевская MS Teams\n" \
       "2) 10.10-11.40 Математический анализ (лекция) 5.09.2022-19.12.2022 Худенко В.Н. MS Teams\n" \
       "3) 11.50-13.20 Программирование микроконтроллеров (лекция) 5.09.2022-19.12.2022 Леонов С.В. MS Teams"
tue2 = "<b>Вторник</b>\n1) 10:10-11:40 Дифференциальные ур. (лек) 233 ауд.\n" \
       "2) 11:50 – 13:20 Мат. Анализ (пр) 231 ауд."

wed2 = "<b>Среда</b>\n1) 8:30-10:00 Физика (пр) 213 ауд. (раз в две недели)\n" \
       "2) 10:10-11:40 Дифференциальные ур. (лаб) 233 ауд.\n" \
       "3) 11:50 - 13:20 Физика (лаб) 226 ауд. (раз в две недели)\n" \
       "4) 13:50 – 15:20 Немецкий ауд.418\n" \
       "5) 15:30 – 17:00 Программ. Микроконтр. Teams\n" \
       "6) 17:10 – 18:40 Опер. Системы и Комп. Сети Teams."
thu2 = "<b>Четверг</b>\n1) 10:10-11:40 Физика (лек) 231 ауд.\n" \
       "2) 11:50-13:20 Английский ауд 232\\Алгоритмы(л.р) ауд 214\n" \
       "3) 13:50 – 15:20 Мат. Логика (пр) 205 ауд.\n" \
       "4) 15:30 – 17:00 Алгоритмы(л.р.) ауд. 214\\Английский ауд 232"
fri2 = "<b>Пятница</b>\n1) 10:10-11:40 Физра\n" \
       "2) 15:30 – 17:00 Мат. Логика (лек) Teams\n" \
       "3) 17:10 – 18:40 Алгоритмы и структуры данных (лек) Teams.\n" \
       "4) 18:50 – 20:20 Опер. Системы и Комп. Сети (лек)Teams."
sat2 = "<b>Суббота</b>\nСегодня пар нет"
sun2 = "<b>Воскресенье</b>\nСегодня пар нет"
days_of_week2 = [mon2, tue2, wed2, thu2, fri2, sat2, sun2]

mon3 = "<b>Понедельник</b>\n1) 8.30-10.00 Физическая культура и спорт Лекция О.Б. Томашевская MS Teams\n" \
       "2) 10.10-11.40 Математический анализ (лекция) 5.09.2022-19.12.2022 Худенко В.Н. MS Teams\n" \
       "3) 11.50-13.20 Программирование микроконтроллеров (лекция) 5.09.2022-19.12.2022 Леонов С.В. MS Teams"
tue3 = "<b>Вторник</b>\n1) 10:10-11:40 Дифференциальные ур. (лек) 233 ауд.\n" \
       "2) 15:30 – 17:00 Мат. Анализ (пр) 231 ауд.\n<b>1 подгруппа:</b>\n" \
       "3) 11:50-13:20 Алгоритмы и структуры данных (лаб) 214 ауд.\n" \
       "4) 13:50 – 15:20 Иностранный (пр) 232 ауд.\n" \
       "<b>2 подгруппа:</b>\n" \
       "5) 13:50 – 15:20 Алгоритмы и структуры данных (лаб) 214 ауд."
wed3 = "<b>Среда</b>\n1) 8:30-10:00 Дифференциальные ур. (лаб) 233 ауд.\n" \
       "2) 10:10-11:40 Физика (лаб) 226 ауд. (раз в две недели)\n" \
       "3) 13:50 – 15:20 Программ. Микроконтр. Teams\n" \
       "4) 15:30 – 17:00 Опер. Системы и Комп. Сети Teams."
thu3 = "<b>Четверг</b>\n1) 8:30-10:00 Физика (пр) 213 ауд. (раз в две недели)\n" \
       "2) 10:10-11:40 Физика (лек) 231 ауд.\n" \
       "3) 11:50-13:20 Мат. Логика (пр) 205 ауд.\n" \
       "2 подгруппа:\n" \
       "4) 13:50 – 15:20 Иностранный (пр) 232 ауд."
fri3 = "<b>Пятница</b>\n1) 11:50-13:20 Физра\n" \
       "2) 15:30 – 17:00 Мат. Логика (лек) Teams\n" \
       "3) 17:10 – 18:40 Алгоритмы и структуры данных (лек) Teams.\n" \
       "4) 18:50 – 20:20 Опер. Системы и Комп. Сети (лек)Teams."
sat3 = "<b>Суббота</b>\nСегодня пар нет"
sun3 = "<b>Воскресенье</b>\nСегодня пар нет"
days_of_week3 = [mon3, tue3, wed3, thu3, fri3, sat3, sun3]


def choose_day(number: int, id_group: str):
    if number > 6:
        number = 0
    if id_group == "third":
        return days_of_week3[number]
    elif id_group == "second":
        return days_of_week2[number]
    elif id_group == "first":
        return days_of_week1[number]
    else:
        return "Вы были некорректно зарегистрированы. Пишите t.me/reverse_light"
