mon = "<b>Понедельник</b>\n1) 8.30-10.00 Физическая культура и спорт Лекция О.Б. Томашевская MS Teams\n" \
      "2) 10.10-11.40 Математический анализ (лекция) 5.09.2022-19.12.2022 Худенко В.Н. MS Teams\n" \
      "3) 11.50-13.20 Программирование микроконтроллеров (лекция) 5.09.2022-19.12.2022 Леонов С.В. MS Teams"
tue = "<b>Вторник</b>\n1) 10:10-11:40 Дифференциальные ур. (лек) 233 ауд.\n" \
      "2) 15:30 – 17:00 Мат. Анализ (пр) 231 ауд.1 подгруппа:\n" \
      "3) 11:50-13:20 Алгоритмы и структуры данных (лаб) 214 ауд.\n" \
      "4) 13:50 – 15:20 Иностранный (пр) 232 ауд.\n" \
      "2 подгруппа:\n" \
      "5) 13:50 – 15:20 Алгоритмы и структуры данных (лаб) 214 ауд."
wed = "<b>Среда</b>\n1) 8:30-10:00 Дифференциальные ур. (лаб) 233 ауд.\n" \
      "2) 10:10-11:40 Физика (лаб) 226 ауд. (раз в две недели)\n" \
      "3) 13:50 – 15:20 Программ. Микроконтр. Teams\n" \
      "4) 15:30 – 17:00 Опер. Системы и Комп. Сети Teams."
thu = "<b>Четверг</b>\n1) 8:30-10:00 Физика (пр) 213 ауд. (раз в две недели)\n" \
      "2) 10:10-11:40 Физика (лек) 231 ауд.\n" \
      "3) 11:50-13:20 Мат. Логика (пр) 205 ауд.\n" \
      "2 подгруппа:\n" \
      "4) 13:50 – 15:20 Иностранный (пр) 232 ауд."
fri = "<b>Пятница</b>\n1) 10:10-11:40 Физра\n" \
      "2) 13:50 – 15:20 Мат. Логика (лек) Teams\n" \
      "3) 15:30 – 17:00 Алгоритмы и структуры данных (лек) Teams.\n" \
      "4) 17:10 – 18:40 Опер. Системы и Комп. Сети (лек)Teams."
sat = "<b>Суббота</b>\nСегодня пар нет"
sun = "<b>Воскресенье</b>\nСегодня пар нет"
days_of_week = [mon, tue, wed, thu, fri, sat, sun]


def choose_day(number: int):
    if number > 6:
        number = 0
    return days_of_week[number]
